[{
    "title": "Resume & Career Review Village",
    "author": "TEKSystems",
    "id": "careervillage",
    "hidden": false,
    "logo": {
      "image_name": "teksystems.png",
      "image_class": "logo-brighten"
    },
    "dates": [{
        "day": "Friday, April 1st"
      },
      {
        "day": "Saturday, April 2nd"
      }
    ],
    "description": "Stop by the TEKsystems Resume & Career Review village to discuss your technical skills and career goals with IT job market experts. Weather you’re looking for advice on the next step in your career or would benefit getting an extra pair of eyes on your resume the TEKsystems team will be happy to discuss the national market landscape with you."
  },
  {
    "title": "Intelligence Village",
    "author": "The OSINTion",
    "id": "intelvillage",
    "hidden": false,
    "logo": {
      "image_name": "osintion.png",
      "image_class": ""
    },
    "dates": [{
        "day": "Friday, April 1st"
      },
      {
        "day": "Saturday, April 2nd"
      }
    ],
    "description": "The Intelligence Village was created to allow a dedicated space for discussions about all forms of Intelligence. \n\nCheck out the Intelligence Village and its unique Capture the Flag (CTF) event, impromptu micro talks, Q&A sessions, and tool demonstrations.  The Intelligence Village seeks to branch beyond cybersecurity applications of Intelligence and enable more conversations with groups outside information security. \n\nThis village is perfect for anybody interested or involved in national security, law enforcement, emergency management, true crime, private and professional investigators, as well as OSINT and Threat Intelligence enthusiasts. "
  },
  {
    "title": "Hardware Hacking Village",
    "author": "Kernelcon",
    "id": "hhv",
    "hidden": false,
    "logo": {
      "image_name": "hhv.png",
      "image_class": "logo-reverse"
    },
    "dates": [{
        "day": "Friday, April 1st"
      },
      {
        "day": "Saturday, April 2nd"
      }
    ],
    "description": "Hardware hackers and novices alike stop by the Kernelcon Hardware Hacking Village. Never soldered? Now’s your chance to play with molten metal! Learn the secrets of modding smart plugs, light strips and other IOT devices.  Our experts will help teach you how to make the blinky-blink.  We will have small project kits and tools to practice your soldering skills. Don’t miss the brightest village at the con - the Hardware Hacking Village."
  },
  {
    "title": "Radio Hacking Village",
    "author": "Kernelcon",
    "id": "rfvillage",
    "hidden": false,
    "logo": {
      "image_name": "rfv.png",
      "image_class": "logo-reverse"
    },
    "dates": [{
        "day": "Friday, April 1st"
      },
      {
        "day": "Saturday, April 2nd"
      }
    ],
    "description": "Visit the Kernelcon Radio Hacking Village to learn more about software defined radio applications.  There will be various radio & wifi hardware if anyone wants to get hands on experience and/or see real-time examples of wireless hacking. Wifi adapters, expoitable routers, RTL-SDRs, signal decoding and cloning."
  },
  {
    "title": "Lockpicking Village",
    "author": "TOOOL",
    "id": "tooolvillage",
    "hidden": false,
    "logo": {
      "image_name": "toool.png",
      "image_class": ""
    },
    "dates": [{
        "day": "Friday, April 1st"
      },
      {
        "day": "Saturday, April 2nd"
      }
    ],
    "description": "Tired of staring at a monitor trying to hack your way through a computer...come try your hand [literally] at hacking hardware! The Open Organisation Of Lockpickers [TOOOL] is set up and ready to give you a new kind of challenge. Gaining access has a different meaning here. TOOOL uses their knowledge to guide you through different types of locks, their vulnerabilities, and how to exploit them. Scrape pin tumblers instead of data!"
  },
  {
    "title": "Mental Health and Wellness Village",
    "author": "Mental Health Hackers",
    "id": "mhhvillage",
    "hidden": false,
    "logo": {
      "image_name": "MHH-white.png",
      "image_class": ""
    },
    "dates": [{
        "day": "Friday, April 1st"
      },
      {
        "day": "Saturday, April 2nd"
      }
    ],
    "description": "The Mental Health and Wellness Village offers a common place to allow like-minded individuals to share and grow as a community, to better our mental health and the health of those around us. Check out the village for fidget tables, crafts, adult coloring books, and more! Visit https://www.mentalhealthhackers.org/ for more information."
  },
  {
    "title": "Wild West Hackin' Fest Labs",
    "author": "WWHF",
    "id": "wwhf",
    "hidden": false,
    "logo": {
      "image_name": "wwhf.svg",
      "image_class": "logo-brighten"
    },
    "dates": [{
        "day": "Friday, April 1st"
      },
      {
        "day": "Saturday, April 2nd"
      }
    ],
    "description": "<p><b>RFID Attacks:</b> Radio Frequency Identification card cloning and hacking. This lab features a door access control system where attendees can use various techniques to clone/duplicate and hack their way into the 'building'.</p><p><b>Mouse/Keyboard Jacking:</b> If you ever wanted to see and do an attack against a wireless keyboard or mouse, this is the lab for you.</p><p><b>Bluetooth Low Energy Lab:</b> Get your hands ready to walk through some Bluetooth hacking. Introduction to common tools used to hack Bluetooth.</p><p><b>Remote-Ding-Dong-Ditch:</b> Probably dating myself but remember the good ole days of ringing your friend's doorbell and running off? Well in this lab we will demonstrate how to conduct research, capture a wireless doorbell signal, analyze it, and replay it. Essentially bringing back an old past time with improved tactics drive by ding-dong-ditching.</p><p><b>Key FOB Attack Lab:</b> Using Software Defined Radio (SDR) you will get the chance to take what you learned with the Remote-Ding-Dong-Ditch lab and apply it to attacking a key fob. This includes how to attack a dynamic code that is changing with every press of the button as opposed to the static signal of the wireless doorbell lab.</p>"
  }
]